CarRentalCA/test/InitTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:car="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/CarRentalBPEL">
  <soapenv:Body>
    <car:InitOperation>
      <part1>Irving</part1>
    </car:InitOperation>
  </soapenv:Body>
</soapenv:Envelope>